OpenFOAM-v1806/tutorials/multiphase/interFoam/RAS/floatingObject/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject
restore0Dir
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
